In [3]:
#sample data frame
import pandas as pd
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

In [5]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [6]:
#another data
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [7]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [16]:
#now we want to join these two data frames by using pd.merge
pd.merge(employees, departments, on="DeptID")#inner join by default
# writing only matching deptIDs

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [15]:
#skip the row 3 because it did not do the mapping at 3rd dept id

In [17]:
pd.merge(employees, departments, on="DeptID", how="left") #left joining

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

on left side is employees, left joining will give all the rows of employees deptName is joing from the departments data it has two row but employess has 3 rows ao in 3rd row it will give NAN

In [18]:
pd.merge(employees, departments, on="DeptID", how="right") #right joing

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

on right side is departments so it will take all the of departments in DeptID but in employees there is not any employee with DeptID 40 so for 40 employee name and id will be NAN

In [20]:
pd.merge(employees, departments, on="DeptID", how="outer") #outer joining

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

outer joing will give all rows for DeptID and where did'nt find any data it will NAN there.

In [21]:
#concatenating: use pd.concat() to stack datasets either vertically or horizontally

In [23]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"]})

In [24]:
df1

    Name
0  Alice
1    Bob

In [25]:
df2

      Name
0  Charlie
1    David

In [26]:
pd.concat([df1, df2]) #for vertical concatenation

      Name
0    Alice
1      Bob
0  Charlie
1    David

In [27]:
pd.concat([df1, df2], axis = 1) #horizontal concatenation

    Name     Name
0  Alice  Charlie
1    Bob    David

In [28]:
# another data frame
df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "Score":[423, 634]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"], "Age":[22, 24]})

In [29]:
df1

    Name  Score
0  Alice    423
1    Bob    634

In [30]:
df2

      Name  Age
0  Charlie   22
1    David   24

In [31]:
pd.concat([df1, df2]) #for vertical concatenation

      Name  Score   Age
0    Alice  423.0   NaN
1      Bob  634.0   NaN
0  Charlie    NaN  22.0
1    David    NaN  24.0

In [32]:
pd.concat([df1, df2], axis = 1) #horizontal concatenation

    Name  Score     Name  Age
0  Alice    423  Charlie   22
1    Bob    634    David   24

In [1]:
# some problems

In [12]:
#Problem 1: Merge Student Details with Marks
import pandas as pd
students = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Ali', 'Zara', 'Ahmed']
})
students

   ID   Name
0   1    Ali
1   2   Zara
2   3  Ahmed

In [13]:
marks = pd.DataFrame({
    'ID': [1, 2, 4],
    'Math': [88, 92, 77]
})
marks

   ID  Math
0   1    88
1   2    92
2   4    77

In [17]:
pd.merge(students, marks,  on="ID") #inner by default

   ID  Name  Math
0   1   Ali    88
1   2  Zara    92

In [18]:
#problem 2: Problem 2: Left Join - Keep All Students, Add Scores
students = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Ali', 'Zara', 'Ahmed']
})
students

   ID   Name
0   1    Ali
1   2   Zara
2   3  Ahmed

In [19]:
scores = pd.DataFrame({
    'ID': [1, 2],
    'Score': [75, 80]
})
scores

   ID  Score
0   1     75
1   2     80

In [20]:
pd.merge(students, scores, on="ID", how="left") #left joining

   ID   Name  Score
0   1    Ali   75.0
1   2   Zara   80.0
2   3  Ahmed    NaN

In [21]:
#problem 3: Use inner join to show only students who have science marks.
students = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Ali', 'Zara', 'Ahmed']
})
students

   ID   Name
0   1    Ali
1   2   Zara
2   3  Ahmed

In [22]:
marks = pd.DataFrame({
    'ID': [1, 2],
    'Science': [85, 90]
})
marks

   ID  Science
0   1       85
1   2       90

In [26]:
pd.merge(students, marks, on="ID")

   ID  Name  Science
0   1   Ali       85
1   2  Zara       90

In [27]:
#problem 4:  Merge both DataFrames on 'ID' and 'Subject' to assign teacher to correct subject.
data1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Subject': ['Math', 'Science', 'Math'],
    'Score': [88, 76, 90]
})
data1

   ID  Subject  Score
0   1     Math     88
1   2  Science     76
2   3     Math     90

In [28]:
data2 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Subject': ['Math', 'Math', 'Science'],
    'Teacher': ['Mr. A', 'Mr. B', 'Ms. C']
})
data2

   ID  Subject Teacher
0   1     Math   Mr. A
1   2     Math   Mr. B
2   3  Science   Ms. C

In [35]:
pd.merge(data1, data2, on=["ID","Subject"])

   ID Subject  Score Teacher
0   1    Math     88   Mr. A

In [36]:
#problem 5: Combine both DataFrames vertically using `pd.concat()`.
df1 = pd.DataFrame({
    'Name': ['Ali', 'Zara'],
    'Math': [80, 85]
})
df1

   Name  Math
0   Ali    80
1  Zara    85

In [37]:
df2 = pd.DataFrame({
    'Name': ['Ahmed', 'Fatima'],
    'Math': [78, 90]
})
df2

     Name  Math
0   Ahmed    78
1  Fatima    90

In [38]:
pd.concat([df1, df2]) #vertical concatenation

     Name  Math
0     Ali    80
1    Zara    85
0   Ahmed    78
1  Fatima    90

In [39]:
pd.concat([df1, df2], axis=1) #horizontal concatenation

   Name  Math    Name  Math
0   Ali    80   Ahmed    78
1  Zara    85  Fatima    90